In [10]:
import pandas as pd

In [11]:
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']b

In [12]:
users = pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.user', 
    sep='|', names=u_cols)

In [14]:
users.s

     user_id  age sex     occupation zip_code
938      939   26   F        student    33319
939      940   32   M  administrator    02215
940      941   20   M        student    97229
941      942   48   F      librarian    78209
942      943   22   M        student    77841

In [15]:
r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.data', 
    sep='\t', names=r_cols)

ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

In [16]:
m_cols = ['movie_id', 'title', 'release_date', 
            'video_release_date', 'imdb_url']

movies = pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.item', 
    sep='|', names=m_cols, usecols=range(5))

In [22]:
print(movies.dtypes)
print(users.dtypes)
print(ratings.dtypes)

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object
user_id        int64
age            int64
sex           object
occupation    object
zip_code      object
dtype: object
user_id           int64
movie_id          int64
rating            int64
unix_timestamp    int64
dtype: object

In [51]:
users[(users.age == 40) & (users.sex == 'M')]

     user_id  age sex  occupation zip_code
18        19   40   M   librarian    02138
82        83   40   M       other    44133
115      116   40   M  healthcare    97232
199      200   40   M  programmer    93402
283      284   40   M   executive    92629
289      290   40   M    engineer    93550
308      309   40   M   scientist    70802
357      358   40   M    educator    10022
397      398   40   M       other    60008
564      565   40   M     student    55422
646      647   40   M    educator    45810
791      792   40   M  programmer    12205
841      842   40   M      writer    93055
917      918   40   M   scientist    70116

In [54]:
users[users.sex == 'F'].age.mean()

33.81318681318681

In [73]:
ratings[ratings.user_id == 2].count()

user_id           62
movie_id          62
rating            62
unix_timestamp    62
dtype: int64

In [109]:
grouped_rating = ratings['rating'].groupby(ratings['movie_id'])
mean_grouped_rating = grouped_rating.mean()
max_mean_rating = mean_grouped_rating.max()
good_movie_ids = mean_grouped_rating[mean_grouped_rating == max_mean_rating].index
movies[movies.movie_id.isin(good_movie_ids)].title

813                         Great Day in Harlem, A (1994)
1121                       They Made Me a Criminal (1939)
1188                                   Prefontaine (1997)
1200           Marlene Dietrich: Shadow and Light (1996)
1292                                      Star Kid (1997)
1466                 Saint of Fort Washington, The (1993)
1499                            Santa with Muscles (1996)
1535                                 Aiqing wansui (1994)
1598                        Someone Else's America (1995)
1652    Entertaining Angels: The Dorothy Day Story (1996)
Name: title, dtype: object

In [132]:
gr = users['sex'].groupby(users['occupation'])
male_dom = gr.apply(lambda x : sum(x == 'M') > sum(x == 'F'))
male_dom

occupation
administrator     True
artist            True
doctor            True
educator          True
engineer          True
entertainment     True
executive         True
healthcare       False
homemaker        False
lawyer            True
librarian        False
marketing         True
none              True
other             True
programmer        True
retired           True
salesman          True
scientist         True
student           True
technician        True
writer            True
Name: sex, dtype: bool

gr